[
    {
        "id":1,
        "name":"Vikram",
        "image":"https://encrypted-tbn2.gstatic.com/images?q=tbn:ANd9GcRcywLT8os8ZXJb7n3hmSzrSzpnLIDNgHeIufdEvCprHyuxThul",
        "url":"https://www.youtube.com/watch?v=OKBMCL-frPU",
        "description":"Vikram is a 2022 Indian Tamil-language action thriller film written and directed by Lokesh Kanagaraj and produced by Raaj Kamal Films International.[8] The film stars Kamal Haasan, Vijay Sethupathi and Fahadh Faasil.[9][10] Kalidas Jayaram,[11] Narain and Chemban Vinod Jose play supporting roles while Suriya makes a cameo appearance as Rolex. The film's soundtrack and score are composed by Anirudh Ravichander, with cinematography handled by Girish Gangadharan and editing done by Philomin Raj. The film serves as the second installment in the Lokesh Cinematic Universe (LCU).[12] The plot follows a black-ops squad led by Agent Vikram, in which he aims to bring down a drug syndicate group called Vetti Vagaiyara, led by Sandhanam, who wants the missing drugs to be delivered to his boss Rolex.",
        "details":"CBFC: U/A 2022 ‧ Action/Mystery ‧ 2h 53m"
    },
    {
        "id":2,
        "name":"Beast",
        "image":"https://encrypted-tbn1.gstatic.com/images?q=tbn:ANd9GcQXT_T2L5qyTIlgkraZUkd2cjuJqtG-dCLBDIMilfaJEE5SIpT9",
        "url":"https://www.youtube.com/watch?v=0q7bKjLa0Nc" ,
        "description":"Beast is a 2022 Indian Tamil-language action film[5] produced by Sun Pictures and written and directed by Nelson. It stars Vijay, Pooja Hegde, Selvaraghavan and Ankur Vikal. The film revolves around an ex-RAW agent's quest to rescue people held hostage in a shopping mall by terrorists.",
        "details":"CBFC: U/A 2022 ‧ Action/Crime ‧ 2h 35m "
    },
    {
        "id":3,
        "name":"Cobra",
        "image":"https://encrypted-tbn2.gstatic.com/images?q=tbn:ANd9GcQW1sa1COJ6uV1j8KiM-hYokXNxddy_IP9CiRh393yS0fJiMzOY",
        "url":"https://www.youtube.com/watch?v=1ntgQ-UWS1k" ,
        "description":"Cobra is a 2022 Indian Tamil-language psychological action thriller film[7] written and directed by R. Ajay Gnanamuthu and produced by S. S. Lalit Kumar, under the banner 7 Screen Studio. The film stars Vikram in a dual role alongside Irfan Pathan, Srinidhi Shetty, Roshan Mathew, K. S. Ravikumar, Anandaraj, Robo Shankar, Miya George, Mirnalini Ravi, Sarjano Khalid and Meenakshi Govindarajan play supporting roles. It also marked the cinematic debut of Indian cricketer Irfan Pathan,[8] and also the Tamil debuts of Shetty, Khalid and Mathew.[9][10] The music is composed by A. R. Rahman, with cinematography handled by Harish Kannan and edited by John Abraham and Bhuvan Srinivasan.[11] In the film, Interpol officer Aslan Yilmas is assigned to catch a mysterious assassin named Cobra, who assassinates people using mathematical skills.",
        "details":"CBFC: U/A 2022 ‧ Mystery/Crime ‧ 2h 55m "
    },
    {
        "id":4,
        "name":"Etharkkum Thunindhavan",
        "image":"https://encrypted-tbn1.gstatic.com/images?q=tbn:ANd9GcS7ynU_nfueSA8k4MKYNWJuNB1L-19xt7FDwEaBuONkxS7Z3MkS",
        "url":"https://www.youtube.com/watch?v=cKrz-kWoaSI" ,
        "description":"Etharkkum Thunindhavan (transl. Daredevil for anything), also known under the initialism ET, is a 2022 Indian Tamil-language action thriller film written and directed by Pandiraj and produced by Sun Pictures. The film stars Suriya, Priyanka Arul Mohan, and Vinay Rai.[6] The music is composed by D. Imman, with cinematography and editing being handled by R. Rathnavelu and Ruben respectively. The film revolves around a lawyer who turns into an executioner against woman trafficking.",
        "details":"CBFC: U/A 2022 ‧ Drama/Action Thriller ‧ 2h 31m  "
    },
    {
        "id":5,
        "name":"Don",
        "image":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRSMJC3ZMxSuQDBkAsSDvrLo3ChSAWjDS4tQf9Sywnu79jikqOO",
        "url":"https://www.youtube.com/watch?v=s5ak-NY6OC8" ,
        "description":"Don is a 2022 Indian Tamil-language coming-of-age comedy drama film written and directed by Cibi Chakaravarthi, in his directorial debut. Produced by Lyca Productions and Sivakarthikeyan Productions, it stars Sivakarthikeyan, S. J. Suryah, Samuthirakani, Priyanka Arul Mohan and Soori. The film revolves around a reluctant engineering student repeatedly clashing with his college's discipline mentor, while still trying to discover his passion in life and prove his eligibility to his father",
        "details":"CBFC: U 2022 ‧ Action/Drama ‧ 2h 45m "
    },
    {
        "id":6,
        "name":"The Warriorr",
        "image":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTLawc0juSW8MSrdSoJpJHDQlr-GwkXxXJ-wLxb-62j3pFWFeYz",
        "url":"https://www.youtube.com/watch?v=EmDNbar5oqk" ,
        "description":"The Warriorr is a 2022 Indian action film directed by N. Lingusamy and produced by Srinivasa Silver Screen. It is shot simultaneously in Telugu and Tamil languages. The film stars Ram Pothineni, Aadhi Pinisetty, Krithi Shetty, Akshara Gowda, and Nadhiya. The film score is composed by Devi Sri Prasad.",
        "details":"CBFC: U/A 2022 ‧ 2h 35m"
    },

    {
        "id":7,
        "name":"Mahaan",
        "image":"https://encrypted-tbn1.gstatic.com/images?q=tbn:ANd9GcQhSyG3uwglCuRYjKyOXKSCmJmtcRG9LsS9Z5-ca9ArJvjNPNBi",
        "url":"https://www.youtube.com/watch?v=yj9l0Jd7I6E" ,
        "description":"Mahaan (transl. The Great) is a 2022 Indian Tamil-language action thriller film[1] written and directed by Karthik Subbaraj and produced by S. S. Lalit Kumar under the banner of Seven Screen Studio. The film stars Vikram, Simran, Dhruv Vikram, Bobby Simha, while Sananth, Vettai Muthukumar, Deepak Paramesh and Aadukalam Naren in supporting roles. The plot revolves around the journey of a commerce teacher named Gandhi Mahaan, who turns into a liquor baron and lives a life of his own after being abandoned by his family.",
        "details":"CBFC: U/A 2022 ‧ 2h 42m "
    },
    {
        "id":8,
        "name":"Maaran",
        "image":"https://upload.wikimedia.org/wikipedia/en/thumb/2/2d/Maaran_2022_poster.jpg/220px-Maaran_2022_poster.jpg",
        "url":"https://www.youtube.com/watch?v=IpDwq7HvTF0" ,
        "description":"Maaran is a 2022 Indian Tamil-language action thriller film written and directed by Karthick Naren, with the screenplay and dialogues were co-written by Suhas-Sharfu and Vivek. Produced by T. G. Thyagarajan, Sendhil Thyagarajan and Arjun Thyagarajan of Sathya Jyothi Films, the film stars Dhanush, Smruthi Venkat, Malavika Mohanan, with Samuthirakani, Ramki, Mahendran and Krishnakumar Balasubramanian appearing in supporting roles. The music is composed by G. V. Prakash Kumar, with cinematography handled by Vivekanand Santhosham and editing handled by Prasanna G. K.",
        "details":"CBFC: U/A 2022 ‧ 2h 10m "
    },
    {
        "id":9,
        "name":"Yaanai",
        "image":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSNCp_SE2y-hiTlIyJ2bJltYEGsabU8zEfsc8Vqn5-_t_G7FA1R",
        "url":"https://www.youtube.com/watch?v=EtfRXSjHdHU" ,
        "description":"Yaanai (transl. Elephant) is a 2022 Indian Tamil-language action drama film written and directed by Hari and produced by Vedikkaranpatti S. Sakthivel, under the banner of Drumsticks Productions. The film stars Arun Vijay and Priya Bhavani Shankar in the lead roles while Ramachandra Raju, Samuthirakani, Rajesh, Raadhika Sarathkumar, Aishwarya, Ammu Abhirami, Yogi Babu and Pugazh appear in other prominent roles. The film's music and score is composed by G. V. Prakash Kumar, with cinematography handled by Gopinath and editing done by Anthony.[3][4] The film revolves around an influential family, who is held responsible for the death of a man's son, where the younger son takes up the responsibility of protecting his family, but has to face personal obstacles.",
        "details":"CBFC: U/A 2022 ‧ 2h 34m "
    },
    {
        "id":10,
        "name":"Viruman",
        "image":"https://encrypted-tbn1.gstatic.com/images?q=tbn:ANd9GcRJjION483qLhSo_jKlbJ2q3n21R-vknTHg0-7jOyt7z7Eeu21S",
        "url":"https://www.youtube.com/watch?v=3c3sV-A8vow" ,
        "description":"Viruman is a 2022 Indian Tamil-language masala film written and directed by M. Muthaiah, and produced by Jyothika and Suriya under 2D Entertainment, it stars Karthi and debutante Aditi Shankar.[2] The music is composed by Yuvan Shankar Raja and cinematography is handled by Selvakumar S. K.[3][4] The film was released theatrically on 12 August 2022 and was a commercial success at the box office.[5][6]",
        "details":"CBFC: U/A 2022 ‧ 2h 31m"
    }

]
